### Lab | SQL Queries - Join Two Tables
In this lab, you will be using the Sakila database of movie rentals. If you need to get the data again, refer to the official installation link.

The database is structured as follows:
![DB schema](https://education-team-2020.s3-eu-west-1.amazonaws.com/data-analytics/database-sakila-schema.png)

1. How many films are there for each of the categories in the category table. Use appropriate join to write this query

In [ ]:
'''
select 
	category.name,
	count(film_category.film_id)
from 
	category
Inner join
	film_category
on
	category.category_id = film_category.category_id
group by
	category.name


Output:
'Action','64'
'Animation','66'
'Children','60'
'Classics','57'
'Comedy','58'
'Documentary','68'
'Drama','62'
'Family','69'
'Foreign','73'
'Games','61'
'Horror','56'
'Music','51'
'New','63'
'Sci-Fi','61'
'Sports','74'
'Travel','57'



'''

2. Which actor has appeared in the most films?

In [ ]:
'''select 
	film_actor.actor_id,
	count(film.film_id) as film_no
from 
	film_actor
Inner join
	film
on
	film_actor.film_id = film.film_id
group by
	film_actor.actor_id
order by
	film_no desc
limit
	1
    
Output:
actor id , film_no
'107','42'


'''

3. Most active customer (the customer that has rented the most number of films)

In [ ]:
'''
select 
	customer.first_name,
    customer.last_name,
	count( distinct(rental.rental_id)) as rental_no
from 
	customer
Inner join
	rental
on
	rental.customer_id = customer.customer_id
group by
	customer.customer_id
order by
	rental_no desc
limit
	1

OUTPUT:
'ELEANOR','HUNT','46'
'''

4. List number of films per `category`.

In [ ]:
##same as nr 1

5. Display the first and last names, as well as the address, of each staff member.

In [ ]:
'''
select 
	staff.first_name,
    staff.last_name,
	address.address,
    address.district
from 
	staff
Inner join
	address
on
	staff.address_id = address.address_id
    
Output:
'Mike','Hillyer','23 Workhaven Lane','Alberta'
'Jon','Stephens','1411 Lillydale Drive','QLD'

'''

6. Display the total amount rung up by each staff member in August of 2005.

In [ ]:
'''
select 
	staff.first_name,
    staff.last_name,
    count(payment.amount) as payment_amount
from 
	staff
Inner join
	payment
on
	staff.staff_id = payment.staff_id
where payment.payment_date like "2005-08%" 
group by
	staff.first_name,
    staff.last_name
    
    
Output:
'Mike','Hillyer','2835'
'Jon','Stephens','2852'
'''

7. List each film and the number of actors who are listed for that film.

In [ ]:
'''
select 
	film.title,
    count(distinct(film_actor.actor_id)) as "actor_no"
from 
	film
Inner join
	film_actor
on
	film.film_id = film_actor.film_id
group by
	film.title
    
Output:
'ACADEMY DINOSAUR','10'
'ACE GOLDFINGER','4'
'ADAPTATION HOLES','5'
'AFFAIR PREJUDICE','5'
'AFRICAN EGG','5'
'AGENT TRUMAN','7'
....
'''

8. Using the tables `payment` and `customer` and the JOIN command, list the total paid by each customer. List the customers alphabetically by last name.

In [ ]:
'''
select 
	customer.last_name,
    customer.first_name,
    count(payment.amount) as "payment_amount"
from 
	customer
Inner join
	payment
on
	customer.customer_id = payment.customer_id
group by
	customer.last_name,
    customer.first_name
order by
	customer.last_name,
    customer.first_name
    
Output:
# last_name, first_name, payment_amount
'ABNEY', 'RAFAEL', '21'
'ADAM', 'NATHANIEL', '28'
'ADAMS', 'KATHLEEN', '27'
'ALEXANDER', 'DIANA', '27'
....
'''

**Bonus**: Which is the most rented film?
The answer is Bucket Brotherhood
This query might require using more than one join statement. Give it a try.

In [ ]:
'''select 
	film.title,
    count(rental.rental_id) as rental_amount
from 
	film
Inner join
	inventory
on
	film.film_id = inventory.film_id
Inner join
	rental
on
	inventory.inventory_id = rental.inventory_id
group by
	film.title
order by
	 count(rental.rental_id) desc
limit
	1

Output:
# title, rental_amount
'BUCKET BROTHERHOOD', '34'

    '''